app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "KFC"], ["created_at", 2017-01-11 16:49:33 UTC], ["updated_at", 2017-01-11 16:49:33 UTC], ["description", "Deep fried goodness"], ["user_id", 10]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    current_user.restaurants.push @restaurant

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find params[:id]

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @restaurant = Restaurant.find params[:id]

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "restaurants" WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Donkey Kong BANANA"], ["description", "OOK! OOK!"], ["updated_at", 2017-01-11 10:09:35 UTC], ["id", 2]]
---
  def update
    @restaurant = Restaurant.find params[:id]
    if current_user.restaurants.include?(@restaurant)
      @restaurant.update restaurant_params

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT  1 AS one FROM "restaurants" WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT $3  [["user_id", 189], ["id", 114], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 28]]
---
  def destroy
    @restaurant = Restaurant.find(params[:id])
    if user_signed_in? && current_user.restaurants.include?(@restaurant)
      @restaurant.destroy